cepawiel/OpenGDEMU/mcu/atsam3u4e-pac/svd/SAM3U4E_patched.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
  <name>SAM3U4E</name>
  <version>0</version>
  <description>Atmel SAM3U4E Microcontroller</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>HSMCI</name>
      <version>6449H</version>
      <description>High Speed MultiMedia Card Interface</description>
      <prependToName>HSMCI_</prependToName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ID_HSMCI</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MCIEN</name>
              <description>Multi-Media Interface Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MCIDIS</name>
              <description>Multi-Media Interface Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PWSEN</name>
              <description>Power Save Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PWSDIS</name>
              <description>Power Save Mode Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWSDIV</name>
              <description>Power Saving Divider</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDPROOF</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRPROOF</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBYTE</name>
              <description>Force Byte Transfer</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PADV</name>
              <description>Padding Value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTOR</name>
          <description>Data Timeout Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTOCYC</name>
              <description>Data Timeout Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOMUL</name>
              <description>Data Timeout Multiplier</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>DTOCYC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>DTOCYC x 16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>DTOCYC x 128</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>DTOCYC x 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>DTOCYC x 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096</name>
                  <description>DTOCYC x 4096</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>65536</name>
                  <description>DTOCYC x 65536</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1048576</name>
                  <description>DTOCYC x 1048576</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDCR</name>
          <description>SD/SDIO Card Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDCSEL</name>
              <description>SDCard/SDIO Slot</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOTA</name>
                  <description>Slot A is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOTB</name>
                  <description>-</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOTC</name>
                  <description>-</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOTD</name>
                  <description>-</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCBUS</name>
              <description>SDCard/SDIO Bus Width</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ARGR</name>
          <description>Argument Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ARG</name>
              <description>Command Argument</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDR</name>
          <description>Command Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CMDNB</name>
              <description>Command Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSPTYP</name>
              <description>Response Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORESP</name>
                  <description>No response.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48_BIT</name>
                  <description>48-bit response.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>136_BIT</name>
                  <description>136-bit response.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1B</name>
                  <description>R1b response type</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPCMD</name>
              <description>Special Command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STD</name>
                  <description>Not a special CMD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Initialization CMD: 74 clock cycles for initialization sequence.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CE_ATA</name>
                  <description>CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IT_CMD</name>
                  <description>Interrupt command: Corresponds to the Interrupt Mode (CMD40).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IT_RESP</name>
                  <description>Interrupt response: Corresponds to the Interrupt Mode (CMD40).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOR</name>
                  <description>Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EBO</name>
                  <description>End Boot Operation. This command allows the host processor to terminate the boot operation mode.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPDCMD</name>
              <description>Open Drain Command</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push pull command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPENDRAIN</name>
                  <description>Open drain command.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXLAT</name>
              <description>Max Latency for Command to Response</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>5</name>
                  <description>5-cycle max latency.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64-cycle max latency.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCMD</name>
              <description>Transfer Command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DATA</name>
                  <description>No data transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_DATA</name>
                  <description>Start data transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_DATA</name>
                  <description>Stop data transfer</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRDIR</name>
              <description>Transfer Direction</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRTYP</name>
              <description>Transfer Type</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>MMC/SDCard Single Block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>MMC/SDCard Multiple Block</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STREAM</name>
                  <description>MMC Stream</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>SDIO Byte</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCK</name>
                  <description>SDIO Block</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOSPCMD</name>
              <description>SDIO Special Command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STD</name>
                  <description>Not an SDIO Special Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>SDIO Suspend Command</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>SDIO Resume Command</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATACS</name>
              <description>ATA with Command Completion Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETION</name>
                  <description>This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_ACK</name>
              <description>Boot Operation Acknowledge.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLKR</name>
          <description>Block Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCNT</name>
              <description>MMC/SDIO Block Count - SDIO Byte Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>MMC/SDCARD Multiple BlockFrom 1 to 65635: Value 0 corresponds to an infinite block transfer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>SDIO ByteFrom 1 to 512 bytes: Value 0 corresponds to a 512-byte transfer.Values from 0x200 to 0xFFFF are forbidden.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCK</name>
                  <description>SDIO BlockFrom 1 to 511 blocks: Value 0 corresponds to an infinite block transfer.Values from 0x200 to 0xFFFF are forbidden.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKLEN</name>
              <description>Data Block Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
