cepawiel/OpenGDEMU/mcu/atsam3u4e-pac/svd/SAM3U4E_patched.svd
        <register>
          <name>CMPMUPD7</name>
          <description>PWM Comparison 7 Mode Update Register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CENUPD</name>
              <description>Comparison x Enable Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTRUPD</name>
              <description>Comparison x Trigger Update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPRUPD</name>
              <description>Comparison x Period Update</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CUPRUPD</name>
              <description>Comparison x Update Period Update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR0</name>
          <description>PWM Channel Mode Register (ch_num = 0)</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_2</name>
                  <description>Master clock/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_4</name>
                  <description>Master clock/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_8</name>
                  <description>Master clock/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_16</name>
                  <description>Master clock/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_32</name>
                  <description>Master clock/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_64</name>
                  <description>Master clock/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_128</name>
                  <description>Master clock/128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_256</name>
                  <description>Master clock/256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_512</name>
                  <description>Master clock/512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_1024</name>
                  <description>Master clock/1024</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CES</name>
              <description>Counter Event Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTE</name>
              <description>Dead-Time Generator Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTHI</name>
              <description>Dead-Time PWMHx Output Inverted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTLI</name>
              <description>Dead-Time PWMLx Output Inverted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY0</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 0)</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty-Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTYUPD0</name>
          <description>PWM Channel Duty Cycle Update Register (ch_num = 0)</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CDTYUPD</name>
              <description>Channel Duty-Cycle Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD0</name>
          <description>PWM Channel Period Register (ch_num = 0)</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRDUPD0</name>
          <description>PWM Channel Period Update Register (ch_num = 0)</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPRDUPD</name>
              <description>Channel Period Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT0</name>
          <description>PWM Channel Counter Register (ch_num = 0)</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DT0</name>
          <description>PWM Channel Dead Time Register (ch_num = 0)</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTH</name>
              <description>Dead-Time Value for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTL</name>
              <description>Dead-Time Value for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTUPD0</name>
          <description>PWM Channel Dead Time Update Register (ch_num = 0)</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTHUPD</name>
              <description>Dead-Time Value Update for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTLUPD</name>
              <description>Dead-Time Value Update for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR1</name>
          <description>PWM Channel Mode Register (ch_num = 1)</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_2</name>
                  <description>Master clock/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_4</name>
                  <description>Master clock/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_8</name>
                  <description>Master clock/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_16</name>
                  <description>Master clock/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_32</name>
                  <description>Master clock/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_64</name>
                  <description>Master clock/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_128</name>
                  <description>Master clock/128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_256</name>
                  <description>Master clock/256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_512</name>
                  <description>Master clock/512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_1024</name>
                  <description>Master clock/1024</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CES</name>
              <description>Counter Event Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTE</name>
              <description>Dead-Time Generator Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTHI</name>
              <description>Dead-Time PWMHx Output Inverted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTLI</name>
              <description>Dead-Time PWMLx Output Inverted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY1</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 1)</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty-Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTYUPD1</name>
          <description>PWM Channel Duty Cycle Update Register (ch_num = 1)</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CDTYUPD</name>
              <description>Channel Duty-Cycle Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD1</name>
          <description>PWM Channel Period Register (ch_num = 1)</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRDUPD1</name>
          <description>PWM Channel Period Update Register (ch_num = 1)</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPRDUPD</name>
              <description>Channel Period Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT1</name>
          <description>PWM Channel Counter Register (ch_num = 1)</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DT1</name>
          <description>PWM Channel Dead Time Register (ch_num = 1)</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTH</name>
              <description>Dead-Time Value for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTL</name>
              <description>Dead-Time Value for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTUPD1</name>
          <description>PWM Channel Dead Time Update Register (ch_num = 1)</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTHUPD</name>
              <description>Dead-Time Value Update for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTLUPD</name>
              <description>Dead-Time Value Update for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
