cepawiel/OpenGDEMU/mcu/atsam3u4e-pac/svd/SAM3U4E_patched.svd
        <register>
          <name>CMR2</name>
          <description>PWM Channel Mode Register (ch_num = 2)</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_2</name>
                  <description>Master clock/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_4</name>
                  <description>Master clock/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_8</name>
                  <description>Master clock/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_16</name>
                  <description>Master clock/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_32</name>
                  <description>Master clock/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_64</name>
                  <description>Master clock/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_128</name>
                  <description>Master clock/128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_256</name>
                  <description>Master clock/256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_512</name>
                  <description>Master clock/512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_1024</name>
                  <description>Master clock/1024</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CES</name>
              <description>Counter Event Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTE</name>
              <description>Dead-Time Generator Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTHI</name>
              <description>Dead-Time PWMHx Output Inverted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTLI</name>
              <description>Dead-Time PWMLx Output Inverted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY2</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 2)</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty-Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTYUPD2</name>
          <description>PWM Channel Duty Cycle Update Register (ch_num = 2)</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CDTYUPD</name>
              <description>Channel Duty-Cycle Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD2</name>
          <description>PWM Channel Period Register (ch_num = 2)</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRDUPD2</name>
          <description>PWM Channel Period Update Register (ch_num = 2)</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPRDUPD</name>
              <description>Channel Period Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT2</name>
          <description>PWM Channel Counter Register (ch_num = 2)</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DT2</name>
          <description>PWM Channel Dead Time Register (ch_num = 2)</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTH</name>
              <description>Dead-Time Value for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTL</name>
              <description>Dead-Time Value for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTUPD2</name>
          <description>PWM Channel Dead Time Update Register (ch_num = 2)</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTHUPD</name>
              <description>Dead-Time Value Update for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTLUPD</name>
              <description>Dead-Time Value Update for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR3</name>
          <description>PWM Channel Mode Register (ch_num = 3)</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Pre-scaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Master clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_2</name>
                  <description>Master clock/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_4</name>
                  <description>Master clock/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_8</name>
                  <description>Master clock/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_16</name>
                  <description>Master clock/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_32</name>
                  <description>Master clock/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_64</name>
                  <description>Master clock/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_128</name>
                  <description>Master clock/128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_256</name>
                  <description>Master clock/256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_512</name>
                  <description>Master clock/512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_1024</name>
                  <description>Master clock/1024</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CES</name>
              <description>Counter Event Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTE</name>
              <description>Dead-Time Generator Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTHI</name>
              <description>Dead-Time PWMHx Output Inverted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTLI</name>
              <description>Dead-Time PWMLx Output Inverted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY3</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 3)</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty-Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTYUPD3</name>
          <description>PWM Channel Duty Cycle Update Register (ch_num = 3)</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CDTYUPD</name>
              <description>Channel Duty-Cycle Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD3</name>
          <description>PWM Channel Period Register (ch_num = 3)</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRDUPD3</name>
          <description>PWM Channel Period Update Register (ch_num = 3)</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPRDUPD</name>
              <description>Channel Period Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT3</name>
          <description>PWM Channel Counter Register (ch_num = 3)</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DT3</name>
          <description>PWM Channel Dead Time Register (ch_num = 3)</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTH</name>
              <description>Dead-Time Value for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTL</name>
              <description>Dead-Time Value for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTUPD3</name>
          <description>PWM Channel Dead Time Update Register (ch_num = 3)</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTHUPD</name>
              <description>Dead-Time Value Update for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTLUPD</name>
              <description>Dead-Time Value Update for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <description>Transmit Pointer Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXPTR</name>
              <description>Transmit Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>Transmit Counter Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXCTR</name>
              <description>Transmit Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TNPR</name>
          <description>Transmit Next Pointer Register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXNPTR</name>
              <description>Transmit Next Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TNCR</name>
          <description>Transmit Next Counter Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXNCTR</name>
              <description>Transmit Counter Next</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCR</name>
          <description>Transfer Control Register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTEN</name>
              <description>Receiver Transfer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXTDIS</name>
              <description>Receiver Transfer Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTEN</name>
              <description>Transmitter Transfer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTDIS</name>
              <description>Transmitter Transfer Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTSR</name>
          <description>Transfer Status Register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTEN</name>
              <description>Receiver Transfer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXTEN</name>
              <description>Transmitter Transfer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
