cepawiel/OpenGDEMU/mcu/atsam3u4e-pac/svd/SAM3U4E_patched.svd
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS13</name>
              <description>WKUP Input Status 13</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS14</name>
              <description>WKUP Input Status 14</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS15</name>
              <description>WKUP Input Status 15</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTT</name>
      <version>6081F</version>
      <description>Real-time Timer</description>
      <groupName>SYSC</groupName>
      <prependToName>RTT_</prependToName>
      <baseAddress>0x400E1230</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ID_RTT</name>
        <description>Real-time Timer Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>RTPRES</name>
              <description>Real-time Timer Prescaler Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALMIEN</name>
              <description>Alarm Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTTINCIEN</name>
              <description>Real-time Timer Increment Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTTRST</name>
              <description>Real-time Timer Restart</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AR</name>
          <description>Alarm Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ALMV</name>
              <description>Alarm Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VR</name>
          <description>Value Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRTV</name>
              <description>Current Real-time Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALMS</name>
              <description>Real-time Alarm Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTTINC</name>
              <description>Real-time Timer Increment</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
